import TitleWithEngSubtitle from "@/components/common/TitleWithEngSubtitle";

const PrivacyPolicyPage = () => {
    return (
        <main className="mx-auto px-10 md:px-0 py-12 min-h-screen theme-gradient-blue">
            <div className="container">
                <TitleWithEngSubtitle
                    title="隱私權政策"
                    subtitle="Privacy Policy"
                    className="pb-7 border-b border-black"
                />
                <p className="container text-h4 whitespace-pre-wrap">
                    {`本隱私權政策旨在說明智兆科技企業有限公司（以下簡稱「本公司」或「我們」）如何蒐集、使用及保護您在瀏覽本公司網站或使用我們提供的服務時所提供的個人資料。我們重視並致力於保護您的隱私，並遵循相關法律規範以確保您的資料安全無虞。

一、隱私權政策的適用範圍
本政策適用於您在使用智兆科技企業有限公司網站及其相關服務時，與個人資料蒐集、處理及利用有關的所有行為。
本政策不適用於以下情況：
非本公司控制或經營的第三方網站、服務或平台。
非本公司所委任或管理的其他網站經營者之資料處理行為。

二、我們蒐集的個人資料類型
當您使用本公司網站或服務時，可能需要提供以下類型的個人資料：
識別資料：如姓名、職稱、聯絡電話、電子郵件地址、公司名稱及職務等。
帳號資訊：用於網站註冊、登入或交易的相關資料。
交易資料：如訂單資訊、付款記錄及相關憑證。
使用行為數據：包括但不限於IP位址、瀏覽器類型、造訪時間、停留時長及其他瀏覽紀錄。
其他您主動提供的資料：如在客服聯繫、問卷調查或活動參與過程中提交的資料。

三、個人資料蒐集之目的及利用方式
本公司蒐集您的個人資料主要用於以下目的：
服務提供與客戶支持：用於處理您的查詢、提供您所需的產品與服務，並回應您的需求。
內部管理與改進：包括網站管理、使用者經驗分析及服務品質提升。
行銷與溝通：透過電子郵件、簡訊或其他聯繫方式，向您推廣產品、服務及特別優惠（僅在獲得您同意後）。
法定或契約義務：遵守適用的法律、法規或政府機構要求。

四、個人資料的保存期限及地區
保存期限
您的個人資料將保存至蒐集目的達成為止，或根據相關法律規定的最長保存期間。
當您請求刪除個人資料時，我們將依法律規定進行資料移除。
資料保存地區
您的資料將儲存在本公司伺服器或信賴的第三方合作夥伴所提供的安全伺服器內，且可能跨國進行傳輸與處理，並遵守當地法律要求。

五、資料分享與第三方使用
本公司不會在未經您明確同意的情況下出售、交換或出租您的個人資料。但在以下情況下，我們可能分享您的資料：
獲得您的授權：經您同意後與特定對象分享資料。
法律要求：依據法律、法院命令或政府機關的合法要求，提供相關資料。
業務合作：與受信任的合作夥伴分享，例如物流公司、付款服務供應商或行銷代理商，並要求他們遵守保密義務。
業務轉讓：如發生公司合併、分立或其他形式的業務重組，我們可能會在適當的資料保護措施下，將您的資料移轉給接手的實體。

六、您的個人資料權利
根據相關法令，您對於個人資料擁有以下權利：
查詢或請求閱覽。
請求提供副本。
請求補充或更正資料。
請求停止蒐集、處理或利用。
請求刪除資料。
如需行使以上權利，請聯繫我們的資料保護專員：[聯絡方式]。

七、Cookie技術的使用
為提供更好的使用體驗，本公司網站可能使用Cookies來記錄您的偏好及瀏覽行為。
使用目的：分析流量數據、追蹤使用者偏好，並提供客製化的內容與建議。
拒絕Cookies：您可以在瀏覽器中設定拒絕Cookies，但這可能影響網站的正常功能。

八、其他網站的連結
本公司網站可能包含第三方網站的連結。這些連結僅供您方便使用，我們對於這些網站的內容或其隱私政策概不負責，建議您在造訪時檢視其隱私條款。

九、資料安全與保護措施
我們採取必要的技術與組織措施來保護您的個人資料，包括但不限於：
資料加密：透過加密技術保護敏感資料的傳輸與儲存。
權限管理：限制資料存取權限，僅授權人員可接觸相關資料。
監控與防護：設置防火牆、入侵檢測系統，防止未授權的存取或資料外洩。
儘管我們已採取多項措施，網路資料傳輸始終具有風險，請您理解資料安全無法保證絕對零風險。

十、政策修訂與通知
我們保留隨時修改本隱私權政策的權利。若政策有重大變更，我們將於網站公告通知您，並提供修訂後的內容以供查閱。若您繼續使用本網站或服務，即視為同意修訂後的政策。

十一、聯繫我們
如有任何疑問、建議或權益主張，請隨時與我們聯繫：
智兆科技企業有限公司地址：825高雄市橋頭區橋都路98號電話：07-3642101電子郵件：taiwan53588280@gmail.com

我們將竭誠為您服務，並以最高標準保護您的個人資料。`}
                </p>
            </div></main>
    )
}

export default PrivacyPolicyPage;